import base64

# هذي الفنكشن الهدف منها اننا نحول الملفات الى صيغة 
# base64
# بنستخدمها واجد فخليتها مني عشان اقدر اسوي لها اكسس وقت ما احتاج
def file_to_base64(django_file):
# اذا كان null يرجع "" فاضي
    if not django_file:
        return ""
    
    # .read: تقرا المحتوى و تخزنه كبايتس
    data = django_file.read()
    try:
        # الفكرة نفس السيدي الي ينقرا بالابرة, في حال قريته الابرة بتكون في النهاية فمابقرا شيء
        # او مثلا الداتا ستكجر ال linked list 
        # اذا وصلت للنهاية لازم ترجع للهد عشان تقرا مرة ثانية
        django_file.seek(0)  

        ## في حالات يمكن الكود مايقبل سييك فيعطي ايررور
    except Exception:
        pass

    # يحول الملف من بايتس الى
    # نحول الملف الى base64 
    return base64.b64encode(data).decode("utf-8")
